; domain
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; 4 Op-blocks world
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;

(define (domain BLOCKS)
  (:requirements :strips)
  (:predicates (on ?o1 ?o2)
	       (ontable ?o1)
	       (clear ?o1)
	       (handempty)
	       (holding ?o1)
	       )

  (:action pick-up
	     :parameters (?o1)
	     :precondition (and (clear ?o1) (ontable ?o1) (handempty))
	     :effect
	     (and (not (ontable ?o1))
		   (not (clear ?o1))
		   (not (handempty))
		   (holding ?o1)))

  (:action put-down
	     :parameters (?o1)
	     :precondition (and (holding ?o1))
	     :effect
	     (and (not (holding ?o1))
		   (clear ?o1)
		   (handempty)
		   (ontable ?o1)))
  (:action stack
	     :parameters (?o1 ?o2)
	     :precondition (and (holding ?o1) (clear ?o2))
	     :effect
	     (and (not (holding ?o1))
		   (not (clear ?o2))
		   (clear ?o1)
		   (handempty)
		   (on ?o1 ?o2)))
  (:action unstack
	     :parameters (?o1 ?o2)
	     :precondition (and (on ?o1 ?o2) (clear ?o1) (handempty))
	     :effect
	     (and (holding ?o1)
		   (clear ?o2)
		   (not (clear ?o1))
		   (not (handempty))
		   (not (on ?o1 ?o2)))))

; problem
(define (problem test-4-3)
(:domain blocks)
(:objects D C B A - object)
(:init
	(handempty)
	(ontable A)
        (ontable B)
	(ontable C)
	(ontable D)

	(clear A)
	(clear B)
	(clear C)
	(clear D)
       )
(:goal (AND

	   (not (handempty))
       	   (holding A)
	   (not (holding B))
	   (not (holding C))
	   (not (holding D))

       	   (ontable D)
           (not (ontable A))
           (not (ontable B))
           (not (ontable C))
	   (not (on D A))
	   (not (on D B))
	   (not (on D C))
	   (not (on D D))	   	   

           (not (on C A))
           (not (on C B))
           (not (on C C))
           (on C D)	   

	   (not (on B A))
	   (not (on B B))
	   (on B C)	   	   
	   (not (on B D))

	   (not (on A B))	   
	   (not (on A A))
	   (not (on A C))
	   (not (on A D))	  

	   (not (clear A))
	   (clear B)
	   (not (clear C))
	   (not (clear D))
)))

; plan
1. (pick-up c)
   deleted: (ontable c) (clear c) (handempty)
   added: (holding c)
   goals met: 21 of 29
2. (stack c d)
   deleted: (holding c) (clear d)
   added: (clear c) (handempty) (on c d)
   goals met: 22 of 29
3. (pick-up b)
   deleted: (ontable b) (clear b) (handempty)
   added: (holding b)
   goals met: 22 of 29
4. (stack b c)
   deleted: (holding b) (clear c)
   added: (clear b) (handempty) (on b c)
   goals met: 25 of 29
5. (pick-up a)
   deleted: (ontable a) (clear a) (handempty)
   added: (holding a)
   goals met: 29 of 29
